### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [69]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

* Display the total number of players

In [70]:
purchase_data["Total Players"] = len(purchase_data["SN"].unique())
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Total Players
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,576
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,576
2,2,Ithergue48,24,Male,92,Final Critic,4.88,576
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,576
4,4,Iskosia90,23,Male,131,Fury,1.44,576

In [71]:
totalP_df = purchase_data["Total Players"]
answer_df = pd.DataFrame(totalP_df)
answer_df.head(1)

   Total Players
0            576

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [72]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Total Players
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,576
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,576
2,2,Ithergue48,24,Male,92,Final Critic,4.88,576
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,576
4,4,Iskosia90,23,Male,131,Fury,1.44,576

In [73]:
unique_items = len(purchase_data["Item ID"].unique())
unique_items

179

In [74]:
avg_price = purchase_data["Price"].mean()
avg_price

3.0509871794871795

In [75]:
purchases = purchase_data["Purchase ID"].count()
purchases

780

In [76]:
total_rev = purchase_data["Price"].sum()
total_rev

2379.77

In [77]:
analysisP_df = pd.DataFrame({
    "Number of Unique Items": [unique_items],
    "Average Price": [avg_price],
    "Number of Purchases": [purchases],
    "Total Revenue": [total_rev]
})
analysisP_df

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179       3.050987                  780        2379.77

In [78]:
analysisP_df["Average Price"] = analysisP_df["Average Price"].map("${:.2f}".format)
analysisP_df

   Number of Unique Items Average Price  Number of Purchases  Total Revenue
0                     179         $3.05                  780        2379.77

In [79]:
analysisP_df.dtypes

Number of Unique Items      int64
Average Price              object
Number of Purchases         int64
Total Revenue             float64
dtype: object

In [80]:
analysisP_df["Total Revenue"] = analysisP_df["Total Revenue"].map("${:,}".format)
analysisP_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     179         $3.05                 780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [81]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Total Players
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,576
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,576
2,2,Ithergue48,24,Male,92,Final Critic,4.88,576
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,576
4,4,Iskosia90,23,Male,131,Fury,1.44,576

In [82]:
malegender_df = purchase_data.loc[purchase_data["Gender"] == "Male", :]
malegender_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Total Players
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,576
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,576
2,2,Ithergue48,24,Male,92,Final Critic,4.88,576
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,576
4,4,Iskosia90,23,Male,131,Fury,1.44,576

In [83]:
SN_counts_male = len(malegender_df["SN"].value_counts())
SN_counts_male

484

In [84]:
femalegender_df = purchase_data.loc[purchase_data["Gender"] == "Female", :]
femalegender_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Total Players
15,15,Lisassa64,21,Female,98,"Deadline, Voice Of Subtlety",2.89,576
18,18,Reunasu60,22,Female,82,Nirvana,4.90,576
38,38,Reulae52,10,Female,116,Renewed Skeletal Katana,4.18,576
41,41,Assosia88,20,Female,7,"Thorn, Satchel of Dark Souls",1.33,576
55,55,Phaelap26,25,Female,84,Arcane Gem,3.79,576

In [85]:
SN_counts_female = len(femalegender_df["SN"].value_counts())
SN_counts_female

81

In [86]:
other_df = purchase_data.loc[purchase_data["Gender"] == "Other / Non-Disclosed", :]
other_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Total Players
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58,576
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81,576
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40,576
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75,576
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39,576

In [87]:
SN_counts_other = len(other_df["SN"].value_counts())
SN_counts_other

11

In [88]:
uniqueplayers_df = len(purchase_data["SN"].unique())
uniqueplayers_df

576

In [89]:
malepercent_df = SN_counts_male / uniqueplayers_df
malepercent_df

0.8402777777777778

In [90]:
femalepercent_df = SN_counts_female / uniqueplayers_df
femalepercent_df

0.140625

In [91]:
otherpercent_df = SN_counts_other / uniqueplayers_df
otherpercent_df

0.019097222222222224

In [92]:
gendercount_df = pd.DataFrame({
    "": ["Male", "Female", "Other / Non-Disclosed"],
    "Total Count": [SN_counts_male, SN_counts_female, SN_counts_other],
    "Percentage of Players": [malepercent_df, femalepercent_df, otherpercent_df],

})
gendercount_df

                          Total Count  Percentage of Players
0                   Male          484               0.840278
1                 Female           81               0.140625
2  Other / Non-Disclosed           11               0.019097

In [184]:
gender_df = gendercount_df.set_index("")
gender_df

                       Total Count  Percentage of Players

Male                           484               0.840278
Female                          81               0.140625
Other / Non-Disclosed           11               0.019097

In [186]:
gender_df["Percentage of Players"] = gender_df["Percentage of Players"].map("{:.2%}".format)
gender_df

                       Total Count Percentage of Players

Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%

                       Total Count Percentage of Players
Male                           484                84.03%
Female                          81                14.06%
Other / Non-Disclosed           11                 1.91%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80